In [62]:
import pandas as pd
import numpy as np

In [63]:
df = pd.read_csv("/Users/armanshaikh/Desktop/pandas-fundamentals/practice_questions/Company Employee Dataset.csv")

In [64]:
df

  emp_id    name department     salary  experience_years        city
0   E101   Rahul         IT   900000.0                 5       Delhi
1   E102  Ananya         HR   600000.0                 4      Mumbai
2   E103    Amit    Finance   850000.0                 6   Bangalore
3   E104   Priya         IT  1200000.0                 8       Delhi
4   E105   Rohit      Sales   700000.0                 3        Pune
5   E106    Neha         HR        NaN                 5      Mumbai
6   E107   Karan    Finance   950000.0                 7   Bangalore
7   E108  Simran      Sales   650000.0                 2  Chandigarh
8   E109   Arjun         IT  1100000.0                 9   Hyderabad
9   E110   Sneha    Finance        NaN                 4       Delhi

In [65]:
# Grouping
# Find:
# Average salary per department

df.groupby("department")["salary"].mean()

department
Finance    9.000000e+05
HR         6.000000e+05
IT         1.066667e+06
Sales      6.750000e+05
Name: salary, dtype: float64

In [66]:
pd.pivot_table(df,index="department",values="salary",aggfunc=["max","mean"])

                  max          mean
               salary        salary
department
Finance      950000.0  9.000000e+05
HR           600000.0  6.000000e+05
IT          1200000.0  1.066667e+06
Sales        700000.0  6.750000e+05

In [67]:
# Top 10 highest paid employees
pd.pivot_table(df,values="salary",index="name").sort_values(by="salary",ascending=False).head(10)

           salary
name
Priya   1200000.0
Arjun   1100000.0
Karan    950000.0
Rahul    900000.0
Amit     850000.0
Rohit    700000.0
Simran   650000.0
Ananya   600000.0

In [68]:
# Employees with:
# Salary > company average
# Experience > 5 AND Salary > 8 LPA
df.loc[df["salary"]>df["salary"].mean()]

  emp_id   name department     salary  experience_years       city
0   E101  Rahul         IT   900000.0                 5      Delhi
3   E104  Priya         IT  1200000.0                 8      Delhi
6   E107  Karan    Finance   950000.0                 7  Bangalore
8   E109  Arjun         IT  1100000.0                 9  Hyderabad

In [69]:
df.loc[(df["salary"]>800000 ) & (df["experience_years"]>5)]

  emp_id   name department     salary  experience_years       city
2   E103   Amit    Finance   850000.0                 6  Bangalore
3   E104  Priya         IT  1200000.0                 8      Delhi
6   E107  Karan    Finance   950000.0                 7  Bangalore
8   E109  Arjun         IT  1100000.0                 9  Hyderabad

In [70]:
# Index → department  
# Values → salary  
# Agg → mean

pd.pivot_table(df,values="salary",index="department",aggfunc="mean")

                  salary
department
Finance     9.000000e+05
HR          6.000000e+05
IT          1.066667e+06
Sales       6.750000e+05

In [71]:
# Find null count in salary column
print(df["salary"].isnull().sum())

2

In [72]:
# Replace null values with department average salary
df["salary"].fillna(df["salary"].mean())

0     900000.0
1     600000.0
2     850000.0
3    1200000.0
4     700000.0
5     868750.0
6     950000.0
7     650000.0
8    1100000.0
9     868750.0
Name: salary, dtype: float64

In [73]:
df

  emp_id    name department     salary  experience_years        city
0   E101   Rahul         IT   900000.0                 5       Delhi
1   E102  Ananya         HR   600000.0                 4      Mumbai
2   E103    Amit    Finance   850000.0                 6   Bangalore
3   E104   Priya         IT  1200000.0                 8       Delhi
4   E105   Rohit      Sales   700000.0                 3        Pune
5   E106    Neha         HR        NaN                 5      Mumbai
6   E107   Karan    Finance   950000.0                 7   Bangalore
7   E108  Simran      Sales   650000.0                 2  Chandigarh
8   E109   Arjun         IT  1100000.0                 9   Hyderabad
9   E110   Sneha    Finance        NaN                 4       Delhi

In [74]:
df["salary"] = df["salary"].fillna(df.groupby("department")["salary"].transform("mean"))

In [75]:
df

  emp_id    name department     salary  experience_years        city
0   E101   Rahul         IT   900000.0                 5       Delhi
1   E102  Ananya         HR   600000.0                 4      Mumbai
2   E103    Amit    Finance   850000.0                 6   Bangalore
3   E104   Priya         IT  1200000.0                 8       Delhi
4   E105   Rohit      Sales   700000.0                 3        Pune
5   E106    Neha         HR   600000.0                 5      Mumbai
6   E107   Karan    Finance   950000.0                 7   Bangalore
7   E108  Simran      Sales   650000.0                 2  Chandigarh
8   E109   Arjun         IT  1100000.0                 9   Hyderabad
9   E110   Sneha    Finance   900000.0                 4       Delhi